challenges/rb_react_ice_cream/ice_cream_api/app/controllers/pints_controller.rb

  def index
    # @pints = Pint.where(ice_cream_id: params[:ice_cream_id])
    @pints = Pint.all
---
SELECT "pints".* FROM "pints" WHERE "pints"."ice_cream_id" IS NULL