projects/cookies/cookies_api/app/controllers/cookies_controller.rb

  def index
    @cookies = Cookie.all
---
SELECT "cookies".* FROM "cookies"