projects/cookies/cookies_api/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("recipe", "user_id", "cookie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe", "Make something tasty"], ["user_id", 1], ["cookie_id", 6], ["created_at", "2020-09-24 19:55:46.630496"], ["updated_at", "2020-09-24 19:55:46.630496"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save